test_cases/RANS_kOmega-SST_2D/steadyState/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1; 

writeControl    adjustable;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;


functions
{
    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        patches         (lowerWall);
        writeFields     true;
        log             true;
        executeControl  writeTime;
        writeControl    writeTime;
    }
   
    // #include "FOs/FOyPlus"
    // #include "FOs/FOwallShearStress"
}


// ************************************************************************* //
